
#include <ansi.h>
#include <task.h>

// 数组：标准提示信息 -- [随意]
mapping TipsTable = ([
	0  :	({ "功能按钮", "游戏的右下方是游戏的功能按钮，如果你是初次进入游戏，我建议你先点击一下各功能按钮的小图标，看看都有什么功能。", }),
	1  :	({ "接任务", "你可以从头顶有黄色小问号的ＮＰＣ人物处"HIR"领取任务"NOR"，然后点击屏幕右下方的"HIR"卷轴型图标"NOR"打开任务界面，查看你的任务信息。", }),
	2  :	({ "交任务", "当你完成某个任务后，你可以点击屏幕右下方的卷轴型图标打开任务界面，并且按照任务界面的提示找到"HIR"任务完成人"NOR"领取奖励。", }),
	3  :	({ "聊天", "你可以在左下方的聊天栏中输入你想告诉别人的信息，然后按回车键发送；聊天栏旁边的按钮可以切换你发送信息的频道。", }),
	4  :	({ "新手活动范围", "除了新手村外，新手村的"HIR"东南面是清溪"NOR"，而西面是"HIR"幽谷"NOR"；这些地方都是新手的主要活动区域，相当适合新手们打怪练级。", }),
	5  :	({ "装备物品", "你可以打开道具栏用"HIR"鼠标右键"NOR"点击可装备的物品，就可以装备该物品了。", "孟子", "如果你想寻找一位玩家做你师父的话，可以到新手村找到"HIR"孟子(136,144)"NOR"，他会帮你免费向全世界发送你寻找师父的信息。", }),
	6  :	({ "组队", "点击右下方的"HIR"组队按钮"NOR"后，你的鼠标会变成小红旗，用这个小红旗点击其他玩家，你就可以邀请他组队。", }),
        7  :    ({ "捉宠", "在"HIR"杂货店"NOR"购买"HIR"乾坤绳"NOR"后，就可以使用"HIR"基础"NOR"技能里面的"HIR"宠物捕捉"NOR"技能把野外的怪物变成你的宠物。", }),
        8  :	({ "卫队长", "在新手村的卫队长处你可以领取到"HIR"协助村庄治安"NOR"任务，协助村庄治安任务是可以无限领取的任务。多完成几次该任务会得到不错的奖励。", }),
        9  :	({ "楚国的10级任务", "再升一级你就10级了，但是建议你到达10级后去"HIR"楚国"NOR"走走，那里还有很多任务等着你去领取呢！", "找个师父", "想更快了解大话战国吗？建议你找新手村的"HIR"孟子（136，144）"NOR"帮你忙去寻找一个玩家做你师父，这样对你了解游戏有很大的帮助！", }),
        10 :    ({ "玩家聚集地－周国", "10级的你已经可以使用驿站，从新手村的驿站去周国"HIR"只需要1金"NOR"，建议10级的你先到大话战国的"HIR"玩家聚集地"NOR"——周国去游览一番。", "加入门派", "恭喜你到达10级，从现在开始你可以选择一个你喜欢的门派加入了，赶快去找"HIR"新手村"NOR"和"HIR"楚国"NOR"的"HIR"门派招募员"NOR"了解一下吧！", }),
        11 :	({ "10到15级练级区域", "楚方城、上庸关、华山、Đào Hoa Nguyên、朝阳峰一带是10级左右玩家的主要活动范围，相当适合现在的你在这些地方打怪练级。", }),
        12 :	({ "师门任务", "在你的门派师父处可以领取到"HIR"师门任务"NOR"，完成10轮的师门任务你可以获得非常丰富的经验奖励，强烈建议你每天都去完成20轮。", }),
        13 :	({ "王捕头", "在"HIR"周国的王捕头"NOR"处你可以领取到一些循环的任务，听说他的任务还可以赚到不少钱啊，过去看看吧！", }),
        14 :	({ "生活技能", "现在的你应该去学习一些"HIR"生活技能"NOR"了，到各国城内找到各"HIR"生活技能师傅"NOR"，你就可以在他们那里学习到对应的生活技能。", "拜师要诀", "新手村的"HIR"孟子（136，144）"NOR"深懂师徒之道，你现在可以主动与其他玩家交谈，让他收你为徒。交谈的时候请注意礼貌待人。", }),
        15 :    ({ "韩国的15级任务", "15级的你现在可以尝试去"HIR"韩国"NOR"，在韩国你会看见很多头顶有黄色小问号的居民在等待着你哦。", }),
        16 :	({ "15到20级练级区域", "听说首阳山、翠华山、函谷关、这几个地方相当适合你在15～20这个等级打怪练级，现在就可以去看看啊！", }),
        17 :	({ "能力提升", "除了提升等级,你还可以通过"HIR"装备"NOR"来提升你的"HIR"能力"NOR"，越是强力的装备越是会给予你越强的能力。", }),
        18 : 	({ "购买装备", "如果你感觉装备不够用的话，你可以去各国的商店处购买对应自己门派的装备，当然你也可以去"HIR"周国的摆摊区"NOR"找找其他玩家的摊档有无适合你的装备。", }),
        19 :	({ "拜师", "还没有找到师父吗？不必怕失败，多尝试向其他高级玩家求师吧！只要到新手村的"HIR"孟子（136，144）"NOR"处，就可以结交师徒关系了！", }),
        20 :    ({ "韩国与魏国的20级任务", "你现在已经20级了！你可以去"HIR"韩国与魏国"NOR"两地领取20级段的任务啦。", }),
        21 :	({ "20到25级练级区域", "以你现在的实力，虎牢关、无定河、无定河畔、襄陵、马陵道、白马庄、马踏湖一带是最适合你练级的地方。", }),
        23 :	({ "摆摊贩卖", "当你身上有多余的物品时，你不妨到"HIR"周国摆摊区"NOR"摆设一个摊位把这些东西卖给其他玩家，通过摆摊出售东西也是一个获得更多金钱的途径。", }),
        24 :	({ "拜师的资本", "24级的你要找个师父已经不是一件难事了！只要主动寻找，一定可以很快找到你的师父。然后与他到"HIR"新手村的孟子（136，144）"NOR"处结成师徒关系！", }),
        25 :    ({ "多交友", "在这个等级段的你应该多"HIR"结交一些好友"NOR"，以便日后共同进退，面对更多困难的任务。", }),
        26 : 	({ "25到30级练级区域", "萁关、晋阳、雁门关、长平、巨鹿、太行山、牧野、桂陵、平原、易水、涿鹿一线是你这个等级段最适合打怪升级的地方。", }),
        28 :	({ "拜玩家为师", "当你等级"HIR"超过30级"NOR"后，你就"HIR"不可以拜其他玩家为师"NOR"了，所以你现在还没有拜其他玩家为师的话，赶快去找个师父吧！", }),
        29 :	({ "师爷", "在"HIR"周国"NOR"有个"HIR"师爷"NOR"叫做"HIR"徐福"NOR"，他负责周国衙门的所有案件的跟踪和追捕。建议你30级后一定要到周国找找他。", }),
        30 :    ({ "楚国的30级任务", "30级的你很久没有回去"HIR"楚国"NOR"看看了吧？赶快回去看看吧！那里现在又有适合你的任务了！", "运镖", "想要赚钱吗？想的话可以"HIR"找周国镇威镖局的尉迟老镖头押镖"NOR"，不过押镖会有一定风险，快去周国找尉迟老镖头问问吧！", }),
        31 :	({ "30到35级练级区域", "大别山脚、大别山、巫山、鄱阳湖这些地方都是现在的你提升等级的最理想地方。多去这些地方走走吧！", }),
        35 :    ({ "齐国的35级任务", "位于最东面的"HIR"齐国"NOR"是一个美丽的国家，那里的居民现在等待着35级的你去帮助他们哦～", }),
        36 :	({ "35到40级练级区域", "泰山、泰山山脚、太湖、赤壁一带都是适合现在这个等级的你经常活动的区域。", "封妖镜", "在周国有一个人叫"HIR"左丘明"NOR"，他可以为你开启一个独占的特殊练级场景。你有空的话不妨去周国找他了解一下。", }),
        40 :    ({ "秦国与燕国的40级任务", ""HIR"秦国与燕国"NOR"是两个边远的国家，40级的你不妨去这两个国家走走,很多任务等待着你呢！", "收徒弟", "当你等级到达40级以后，你就可以找一个"HIR"30级以下"NOR"的玩家到周国的"HIR"孔夫子"NOR"处结成"HIR"师徒关系"NOR"了。", }),        
        41 :	({ "40到45级练级区域", "40多级的你有东海渔村、东海岸、海滨、东海岛这些地方等待着你去探索。听说还有人在那里的某个海滨见过一只奇怪的狗！", }),
        45 :    ({ "燕国的45级任务", "这么快就到达45级了？多去"HIR"燕国"NOR"看看吧！那里有许多适合现在的你的任务。", }),
        46 :	({ "45到50级练级区域", "如果你在寻找适合你练级的怪物的话，位于秦国附近的郑国渠是你值得一去的地方。", }),
        50 :    ({ "燕国与赵国的50级任务", "50级的你已经可以独当一面了！去"HIR"燕国和赵国"NOR"这两个相邻的国家看看，那里很多居民等待着你帮助。",  }),        
        51 :	({ "50到55级练级区域", "位于东北面的长白山、玉柱峰、白云峰、长白天池是50级左右的玩家居家旅行，打怪练级的必到场所。你今天去过没有啊？", }),
        55 :	({ "赵国的55级任务", "当年赵武灵王实行“胡服骑射”让赵国人个个能征善战，建议55级的你去赵国拜访一下赵国居民，那里又有许多可以让你领取的任务了。", }),
        56 :	({ "55到60级练级区域", "燕长城不知道你去过没有？那个地方以你现在的实力练级非常适合。", }),
        60 :	({ "秦国的60级任务", "自商鞅变法之后，秦国不断壮大，现在已经成为七国之中最强大的国家了。建议你去秦国走一趟，有很多的任务正等待着你去领取！", }),
        61 :	({ "60到65级练级区域", "赵国的赵长城是赵国建的长城…什么？你说这是废话！哼，我是不会告诉你现在最好的练级地方是赵长城的！", }),
        65 :	({ "秦国的65级任务", "听说以你现在这样的实力，留在秦国还可以领取到很多任务，你还是赶快回秦国看看吧！", }),
        66 :	({ "65到70级练级区域", "秦长城卫兵厉害不知道你以前领教过没有？不过以你现在的实力，已经足够与秦长城的卫兵抗衡了！秦长城就在秦国的北面。", }),
        70 :	({ "韩国的70级任务", "七国中，韩国算是比较弱小的一个国家。现在韩国的人很需要70级左右的人去帮忙，现在你就是70级的人！赶快去韩国看看吧！", }),
        71 :	({ "70到75级练级区域", "从韩国走路去唐府庄园要经过一段弯道，你知道吗？那个地方有许多70级左右的密探，水贼出现。", }),
        75 :	({ "探索战国", "现在的你已经具备了一定的实力，可以去更深入的地方探索了，许多地下洞穴适合现在实力的你去探索。战国的无限精彩正等待着你！", }),
]);





mapping GTipsTable = ([
        1  :    ({ "大话战国", "欢迎来到大话战国，我是战国小帮手，我会在你的游戏过程中给你提供各类简单的教程讯息。右键点击我，可以重置我的教程信息。", }),
        2  :    ({ "领取任务", "游戏中有可领取的剧情任务的NPC头顶都会有一个"HIR"黄色的小问号"NOR"作为标记。", }),
        3  :    ({ "双倍经验时间", "每个星期都可以找神仙爷爷领取4个小时的"HIR"双倍经验时间"NOR"。在双倍经验时间内击败怪物所获得的经验将翻倍。", }),
        4  :    ({ "使用当铺", "你可以把你道具栏暂时不用的物品和金钱免费存放在当铺内，等有需要再取出来。", }),
        5  :    ({ "购买物品", "点击商铺里面的物品，选择好数量再点击确认，就可以购买物品了。当然你也可以把你道具栏的物品拖放到商店栏里"HIR"出售"NOR"换取金钱。", }),
        6  :    ({ "修理物品", "如果你的装备耐久下降了，你可以去"HIR"修理店老板"NOR"处支付一定金钱修理装备。", }),
        7  :    ({ "鉴定物品", "你可以把"HIR"未鉴定"NOR"的装备拿去"HIR"修理店老板"NOR"处进行鉴定，但必须支付少量金钱。", }),
        8  :    ({ "装备物品", "你可以打开道具栏用"HIR"鼠标右键"NOR"点击可装备的物品，就可以装备该物品了。", }),
        9  :    ({ "使用药品", "打开道具栏右键点击相应的药品，就可以使用该药品了。", }),
        10 :    ({ "使用酒食", "如果你道具栏里面有食物和酒的话，你可以使用这些酒食恢复气血和法力。但是在进食时你不可以进行"HIR"移动以外的任何动作"NOR"。", }),
        11 :    ({ "快捷栏", "你可以把你常用的技能、物品放在屏幕左下的快捷栏里面，再点击相应的快捷键(F1到F10)使用。", }),
        12 :    ({ "战斗", "把鼠标移到怪物身上点击左键，就可以对怪物发动攻击，同时自己进入战斗状态。", }),
        13 :    ({ "死亡", "你的角色死亡后，你可以选择马上在复活点复活或者等待其他懂复活法术的玩家救援，15级以后的玩家自动复活会损失一定的现金和经验。", }),
        14 :    ({ "拾取物品", "击倒怪物后，怪物可能会掉落一些物品，把鼠标移到掉落在地上的物品上，然后点击"HIR"左键"NOR"就可以"HIR"拾取"NOR"该物品。并存放到你的背包里面。", }),
        15 :    ({ "宠物", "你可以按"HIR"ALT＋R"NOR"打开宠物属性界选择宠物参战，让宠物辅助你战斗。", }),
        16 :    ({ "使命人物", "如果能击败使命人物，你可以获得一定的"HIR"经验和潜能"NOR"奖励。", }),
        17 :    ({ "使命物品", "把使命物品交给新手村的"HIR"卫队长"NOR"，可以换取比较丰厚的奖励。", }),
        18 :    ({ "比武场", "镇威镖局的"HIR"武师"NOR"可以把你送到"HIR"比武场"NOR"，在比武场内你可以随意跟其他玩家切磋而不必担心死亡后会有惩罚。", }),
        19 :    ({ "手动升级", "当累积经验满足升级需要时，按ALT+W打开人物属性界面，并点击界面下方的升级按钮就可以升级。", }),
        20 :    ({ "分配点数", "打开人物属性界面就可以对你未分配的点数进行分配。", }),
        21 :    ({ "查看地图", "快捷键ALT+D可以让你查看当前场景的"HIR"区域地图"NOR"，ALT+M则可以查看"HIR"世界地图"NOR"。", }),
        22 :    ({ "添加好友", "如果你与其他的玩家相处得很愉快，不妨点击右下方功能按钮的握手形状的图标，把该名玩家"HIR"添加为好友"NOR"。", }),
        23 :    ({ "摆摊", "在摆摊区，你可以使用基础技能中的摆摊技能自己建立一个摊位，把一些不常用的东西卖给其他玩家。", }),
        24 :    ({ "装备绑定", "有些装备在拾取后或者装备后会"HIR"绑定在身上"NOR"，绑定后的装备是不可以跟其他玩家交易的。", }),
        25 :    ({ "加入国家", "战国七雄是齐、韩、赵、魏、秦、楚、燕七国。你可以选择一个你喜欢的国家，然后到该国的户籍官处选择加入该国。", }),
        26 :    ({ "加入帮派", "加入国家后，你就可以在自己国家的"HIR"帮派总管"NOR"处"HIR"申请加入"NOR"一个帮派，加入帮派是一个结交更多好友的捷径。", }),
        27 :    ({ "师门技能", "你可以点击右下方的书本形图标打开技能界面，然后把你的技能拖放到快捷栏中使用。", }),
        28 :    ({ "使用生活技能", "学会生活技能后，你可以点击右下方的书本形图标打开技能界面，在辅助技能处点击生活技能进行生产。但生产需要消耗特定的材料的。", }),
        29 :    ({ "功德点", "当你等级到达50级以后，你带一个30级以下的玩家升级可以获得一定的功德值，功德值可以在功德老人处换取不错的奖励。", }),
        30 :    ({ "优秀装备", "有些装备的名称颜色要比一般的装备颜色绚丽，通常这些装备的属性都要比一般的白色装备优秀不少。", }),
        31 :    ({ "装备精炼", "当你获得晶石后，你可以把晶石与其对应的装备放在一起精炼，这样可以让你的装备威力大增。",}),
        32 :    ({ "婚姻", "如果有一位与你两情相悦的异性玩家，不妨尝试一下对对方表达爱意，在游戏中与她（他）结成连理。鹊台的月老与红娘会为你们俩作见证。", }),
        33 :    ({ "世界BOSS", HIR"世界BOSS"NOR"是一种非常强力的怪物。如果你对自己能力有自信的话，不妨多招募些好友来一齐挑战他。击败他会获得非常丰厚的奖励。", }),
        34 :    ({ "使用信物", "点击"HIR"门派信物"NOR"或者使用基础技能里面的使用信物技能，就可以把你传送回新手村或者你所在的门派。", }),
        35 :    ({ "潜能", "消灭怪物除了能获得经验外，还能获得"HIR"潜能"NOR"。潜能是作为以后技能修炼时的一种消耗，越高级的技能消耗的潜能就越多。", }),
        36 :    ({ "升级", "等级提升后人物的能力会相应增强，同时会获得" HIR "四个属性点" NOR "的奖励。在人物属性界面可以将点数自由分配到 "HIR "五项基本属性" NOR "中。", }),
        37 :    ({ "新手村", "这里是新手村，是新手们的聚集地，也是无数勇士成长的故乡。拜访这里的村民，聆听他们的谈话，会了解到这个世界的更多事情。",}),
        38 :    ({ "店铺", "基本的店铺有武器店、防具店、杂货店和药店，还有作为仓库用途的当铺。这些店铺是玩家与 NPC 互动交易的主要场所。", }),
        39 :    ({ "武器店", "您可以在武器店买到刀、枪、剑、棍、拳套、暗器等不同种类的武器。同时您也可以将自己身上没用的物品卖给武器店老板。", }),
        40 :    ({ "防具店", "防具店可以买到各种各样防具用品。同时您也可以将自己身上没有用的物品卖给防具店老板。", }),
        41 :    ({ "杂货店", "您可以在杂货店买到各种必须的用品，比如回城符、飞行符等等。您也可以将自己身上没用的物品卖给杂货店老板换取一些金钱。", }),
        42 :    ({ "药店", "在药店老板处你可以购买到各类恢复气血和法力的药品，出门在外，肯定少不了多带些药品防身的了。", }),
        43 :    ({ "离开队伍", "你加入了一个队伍，如果想离开队伍的话，右键点击游戏"HIR"界面左上方"NOR"自己的头像，在弹出菜单选择离队就可以了。", }),
        44 :    ({ "发送道具信息", "按住Shift键再点击你拥有的一件道具，可以把该件道具的信息发送到聊天栏中，让其他人看见。", }),
        45 :    ({ "聊天栏的玩家", "按住Shift键再点击任何一个在聊天栏中的玩家名字，就可以打开和这个玩家交互的右键菜单。", }),
        46 :	({ "生活技能工具", "除酒食外，其他7个生活技能都需要对应的工具，生活技能的初级工具可以在与生活技能对应的国家的杂货店老板处购买。", }),
        47 : 	({ "气血恢复", "如果你的气血下降到0，你就会死亡。你可以使用"HIR"药物"NOR"和"HIR"酒食"NOR"恢复你减少了的气血。", }),
        48 :	({ "对话", "用鼠标左键点击一个NPC，就可以打开与该NPC的对话。", }),
        49 :	({ "功能按钮", "游戏的右下方是游戏的功能按钮，如果你是初次进入游戏，我建议你先点击一下各功能按钮的小图标，看看都有什么功能。", }),
        50 :	({ "聊天栏", "游戏的左下方是聊天栏，就可以在聊天栏中输入信息，建议你先尝试点击聊天栏上的各个按钮，认识一下聊天功能。", }),
        51 :	({ "饰品店", "饰品店老板是出售鞋子和腰带的商人，跟普通商人一样，你也可以将自己身上没有用的物品卖给饰品店老板。", }),
        52 :	({ "修理店", "修理店老板是一个武器装备的专家，他不但可以帮你修理损坏的装备，如果你有未鉴定的装备也可以拿给他帮你鉴定一番。", }),
        53 :	({ "酒店老板", "在酒店老板这里，你不但可以购买到许多酒食，许多生活技能需要的材料都需要从这里购买。", }),
        54 :	({ "收费频道", "使用公众频道和谣言频道发言是需要收取一定的费用的。使用一次公众频道要收取200金，使用一次谣言频道要收取1000金。", }),
]);


// 函数：显示提示信息(标准)
void send_level_tips( object me, int level )
{
        string * info, result;
        info = TipsTable[level];
        if( sizeof(info)<2 ) return;
        result = sprintf("%-20s%s", info[0], info[1]);
        send_user( me, "%c%w%s", 0x63, level*2+1002, result );
	if( sizeof(info)==4 )
	{
        	result = sprintf("%-20s%s", info[2], info[3]);
        	send_user( me, "%c%w%s", 0x63, level*2+1+1002, result );
        }
}

// 函数：显示提示信息(标准)
void send_level_tips2( object me, int level )
{
        string * info, result;
        info = TipsTable[level];
        while( sizeof(info)<2 && level>=0 )
        {
        	level --;
        	info = TipsTable[level];
        }
        result = sprintf("%-20s%s", info[0], info[1]);
        send_user( me, "%c%w%s", 0x63, 1000, result );
	if( sizeof(info)==4 )
	{
        	result = sprintf("%-20s%s", info[2], info[3]);
        	send_user( me, "%c%w%s", 0x63, 1001, result );
        }
}

void send_help_tips(object me, int type)
{
	int * status;
	int i, locate, pos;
	string * info, result;
	status = me->get_save("tipstatus");
	if (!status) status = ({ });
	// 检查是否已发过
	locate = type/30;
	pos = type % 30;
	if (sizeof(status)>=locate+1)
	{
		if ((status[locate] & (1<<pos))!=0) return;
		status[locate] = status[locate] | (1<<pos);
	}
	else
	{
		while (sizeof(status)<locate+1)
			status += ({ 0 });
		status[locate] = status[locate] | (1<<pos);
	}
	me->set_save("tipstatus", status);
	info = GTipsTable[type];
        if( sizeof(info)<2 ) return;
        result = sprintf("%-20s%s", info[0], info[1]);
        send_user( me, "%c%w%s", 0x63, type+10, result );
//        send_user( me, "%c%s", ';', result );
//        tell_user(me, info[1]);
}