
#include <ansi.h>
#include <task.h>

// 数组：标准提示信息 -- [随意]
mapping TipsTable = ([
	1    :  "对不起，您没有对应的奖励。",
	1001 :	"对不起，你没有获得新人王的奖励！", 
        1004 :	"对不起，你并没有参加过客户端抽奖，您将不能获得相应奖品！",
        1005 : 	"对不起，你没有用探宝卡号激活过当前角色所对应的帐号，您不能获得相应的奖品！",
        1006 :	"对不起！您单次充值不满100元宝，您不能获得紫参丹的奖励！",
        1007 :	"对不起！您单次充值不满100元宝，您不能获得兑奖牌！",
        1008 : "你必须使用大话战国的物品激活码在网站上激活无敌宝宝包的领取活动。",
        1009 :	"此角色所对应的帐号并没有被缘分序列号激活哦～！因此，你将不能领取缘分宠物！倘若你想知道详细的信息，请留意官方公告或登陆www.zg.mop.com进行查询！",
        1010 :	"此角色所对应的帐号并没有被缘分序列号激活哦～！因此，你将不能领取缘分宠物！倘若你想知道详细的信息，请留意官方公告或登陆www.zg.mop.com进行查询！",
        1011 : 	"对不起您不是获奖玩家不能领取骑宠！",
        1014 : 	"你并没有购买过黄金兑奖卡，怎么可以来冒领奖励呢？",
]);



// 函数：显示提示信息(地图)
void send_error_tips( object me ) 
{ 
        int id;
	id = me->get("phpnum");

        if( id==0 || !TipsTable[id] ) id = 1;
        send_user( me, "%c%s", ';', TipsTable[id] );
        me->delete("phpnum");
}
